{"parts": {
    "scenarios": [
      {
        "scenario": "Go up the grand staircase?",
        "Death":  "While exploring the rooms, you fall through the floor and into the basement. The fall breaks both your legs, and you lay there for days, screaming in pain where no one can hear you.\nBeing driven crazy by your illusions, you grab a piece of wood from the floor, and stab yourself in the neck. You bleed to death slowly... May NAME rest in peace",
        "decisions":
        [
            {
            "DecisionA": ["Yes", "True"],
            "DecisionB": ["Explore the rooms", "False"],
            "DecisionC": ["Turn around and leave", "follow"]
            }
        ],
        "followup": [
            {
                "Question": "Go up the grand staircase?",
                "Death": "You decide to stay downstairs, and sit against the wall, desperate. You lost your energy and will to continue, and you starve to death from hunger and thirst.\nYour body is only discovered years later after being blown to pieces with dynamite used to destroy the building. Terrible way to be remembered.. May NAME rest in peace.",
                "Story": "As you turn around you see the large, heavy doors close behind you, upon trying to open them, the doorknobs seem to dissapear, and a wall replaces them. This marks the start of your greatest fear...",
                "DecisionA": ["Yes", "True"],
                "DecisionB": ["No", "False"]
            }
            ]
      },
      {
        "scenario": "Go to sleep?",
        "Death":  "Approaching the window, you suddenly hear a whisper behind you, it startles you as you turn around swift and back up. scared by a sudden shadow appearing in front of you, you back up too fast and shatter the window as you fall through.\nYou fall down, and onto a fench that pierces you through the heart, you never stood a chance. May NAME rest in peace.",
        "decisions": [
          {
          "DecisionA": ["Go to the window", "False"],
          "DecisionB": ["Lay on the floor instead", "follow"],
          "DecisionC": ["Yes", "True"]
      }
        ],
        "followup": [
            {
                "Question": "Run out of the room?",
                "Death": "Being scared, you decide to run off and down the stairs. Unfortunately, you were too fast, and fall down the grand staircase. you hit your head on one of the staircases while rolling down and it splits your skull clean open, resulting in NAME's unfortunate death",
                "Story":  "As you grab the blanket off the bed and lay down, you see a disformed, demonic face staring at you from under the bed. It freaks you out and scares you. You hear it's bones crack loudly as it starts to crawl out. You can either run out the room, or close your eyes and accept fate...",
                "DecisionA": ["Yes, running for my life", "False"],
                "DecisionB": ["No,  i'll accept fate", "True"]
            }
            ]
      },
      {
        "scenario": "Go to the kitchen",
        "Death":  "You get too much, making you drowsy and dizzy.  You fall, and hit your head on a sharp object. The object stabs your eye out and pierces into your brain, killing you instantly",
        "decisions": [
          {
            "DecisionA": ["Yes", "True"],
            "DecisionB": ["Go to the wine cellar instead", "False"],
            "DecisionC": ["Go back to sleep instead", "False"]
          }
          ],
        "followup": [
            {
                "Question": "null",
                "DecisionA": "null",
                "DecisionB": "null"
            }
            ]
      }
    ],
  "story": [
    {
      "Scenario0": "It's storming, and you need a place for shelter. With limited options, and most of the houses too ruined, you can only choose for the big, dark mansion down the path into the forest.\nA choice you shall soon seem to regret. The doors creak as you open them; the mansion is dark and empty, but surprisingly warm.\nA grand staircase finds itself in front of you, and two rooms find themself on your left and right.",
      "Scenario1": "Narrowly avoiding death by going upstairs, you decide to get some rest and head to what appears to be a bedroom. You check the old watch on your wrist, it was a gift from your deceased grandfather. '01:26' shows the watch.",
      "Scenario2": "The night passes, or so it should... When you wake up from your slumber, you look at the window. It's.. still night? You check your watch, bewildered by what you are seeing. '11:58' it says. You scream in confusion and fear. After calming down, you decide to search for food. Should be in the kitchen, right?"
    }
  ]
  }
}